FV2304/E_0205.puml
@startuml
skinparam Shadowing false
skinparam NoteBorderColor #f3f1f6
skinparam NoteBackgroundColor #f3f1f6
skinparam NoteFontSize 12
skinparam ActivityBorderColor none
skinparam ActivityBackgroundColor #7a8da1
skinparam ActivityFontSize 16
skinparam ArrowColor #7aab8a
skinparam ArrowFontSize 16
skinparam ActivityDiamondBackgroundColor #7aab8a
skinparam ActivityDiamondBorderColor #7aab8a
skinparam ActivityDiamondFontSize 18
skinparam defaultFontName DejaVu Serif Condensed
skinparam ActivityEndColor #669580

header
<b>FV2210
2022-12-12
endheader

title
WiM Strom

9.9.1: AD: Angebot zur Rechnungsabwicklung des Messstellenbetriebes über den LF durch den MSB



end title
:<b>E_0205</b>;
note right
<b><i>Prüfende Rolle: LF
end note

if (<b>1: </b> Liegt ein gültiger Vertrag zwischen MSB und LF vor, der die Rechnungsabwicklung des Messstellenbetriebs an den LF regelt?) then (ja)
else (nein)
    :A01;
    note left
        Kein gültiger Vertrag
    endnote
    kill;
endif
if (<b>2: </b> Sind alle Messlokationen der angefragten Marktlokationen mit kME ausgestattet?) then (ja)
    :A02;
    note left
        Ausschließlich mit kME ausgestattet
    endnote
    kill;
else (nein)
endif
if (<b>3: </b> Lässt das Vertragsverhältnis mit dem Kunden die Abrechnung des Messstellenbetriebs zu?) then (ja)
else (nein)
    :A03;
    note left
        Vertragsverhältnis mit Dritten lässt Abrechnung des Messstellenbetriebs nicht zu
    endnote
    kill;
endif
if (<b>4: </b> Lässt das Vertragsverhältnis mit dem Kunden das im Angebot benannte Beginndatum zum Messstellenbetrieb zu?) then (ja)
else (nein)
    :A04;
    note left
        Vertragsverhältnis mit Dritten lässt das Beginn-datum nicht zu
    endnote
    kill;
endif
if (<b>5: </b> Handelt es sich um ein Angebot auf Basis eines Preisblattes?) then (ja)
    if (<b>6: </b> Liegt dem LF das Preisblatt mit dem im Angebot an-gegebenen Preisschlüsselstamm vor?) then (ja)
    else (nein)
        :A05;
        note left
            Kein Preisblatt vorhanden
        endnote
        kill;
    endif
    if (<b>7: </b> Entsprechen die angebotenen Positionen dem Vertragsverhältnis mit dem Kunden?) then (ja)
        :Bestellung versenden;
        kill;
    else (nein)
        :A06;
        note left
            Angebotspositionen abweichend zum Vertrags-verhältnis
        endnote
        kill;
    endif
else (nein)
endif
if (<b>7: </b> Entsprechen die angebotenen Positionen dem Vertragsverhältnis mit dem Kunden?) then (ja)
    :Bestellung versenden;
    kill;
else (nein)
    :A06;
    note left
        Angebotspositionen abweichend zum Vertrags-verhältnis
    endnote
    kill;
endif

@enduml
